proj-test/load-data.yml
config:
  target: 'https://cc25appnorwayeast4204.azurewebsites.net/rest'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"
  phases:
  - name: "Create users"    # Create users
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Create users'
    weight: 1
    flow:
      - loop:                            # let's create 950 users - loop ... count
        - post:                          # First: post image for the user
            url: "/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture: 
              regexp: "(.+)"
              as: "imageId"              # capture the reply as image id to be used in user creation
        - function: "genNewUser"         # Generate the needed information for the user
        - post:
            url: "/user"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              id: "{{ uId }}"
              name: "{{ uName }}"
              pwd: "{{ uPwd }}"
              photoId: "{{ imageId }}"
              legoIds: []
            afterResponse: "genNewUserReply"    # capture result and store in file
        - post:                          # First: login as a user
            url: "/user/auth"
            headers:
              Content-Type: application/json
            json:
              user: "{{ uId }}"
              pwd: "{{ uPwd }}"
        count: 200      
      - loop:                            # let's create 500 legosets - loop ... count
        - post:                          # First: post image for the legoset
            url: "/media"
            headers:
              Content-Type: image/jpeg
              Accept: application/json
            beforeRequest: "uploadImageBody"
            capture: 
              regexp: "(.+)"
              as: "imageId"              # capture the reply as image id to be used in legoset creation
        - function: "genNewLegoSet"         # Generate the needed information for the legoset
        - post:
            url: "/legoset"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              name: "{{ lsName }}"
              description: "{{ lsDescription }}"
              photoIds: ["{{ imageId }}"]
            capture: 
              json: "$.id"
              as: "lsId"              # capture the legoset id to be used in adding legosets to users
        - loop:
          - function: "selectUser"   # select a user to own this legoset
          - post:                     # First: login as a user
              url: "/user/auth"
              headers:
                Content-Type: application/json
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:                          # Second: post owner
              url: "/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          whileTrue: "randomLoop90"
        - loop:                            # let's create random comments - loop ... whileTrue90
          - function: "genProductComment"   # generate a comment for the product
          - post:                          # First: login as a user
              url: "/user/auth"
              headers:
                Content-Type: application/json
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:                          # Second: post owner
              url: "/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          - post:                          # Third: post comment
              url: "/legoset/{{ lsId }}/comment"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoSetId: "{{ lsId }}"
                user: "{{ uId }}"
                text: "{{ cmtText }}"
          whileTrue: "randomLoop90"
        - loop:                 # let's create random auctions - loop ... whileTrue70
          - function: "genNewOldAuction"   # generate a auction for the product
          - post:                          # First: login as a user
              url: "/user/auth"
              headers:
                Content-Type: application/json
              json:
                user: "{{ uId }}"
                pwd: "{{ uPwd }}"
          - patch:                          # Second: post owner
              url: "/user/{{ uId }}"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoIds: ["{{ lsId }}"]
          - post:                          # Third: post auction
              url: "/auction"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                legoSetId: "{{ lsId }}"
                seller: "{{ uId }}"
                startingPrice: "{{ aucStartingPrice }}"
                endDate: "{{ aucEndDate }}"
              capture: 
                json: "$.id"
                as: "aucId"         # capture the auction id to be used in bid creation creation
          - loop:                 # let's create random bids - loop ... whileTrue90
            - function: "genNewOldBid" 
            - post:                          # First: login as a user
                url: "/user/auth"
                headers:
                  Content-Type: application/json
                json:
                  user: "{{ uId }}"
                  pwd: "{{ uPwd }}"
            - post:                          # Second: post bid
                url: "/auction/{{ aucId }}/bid"
                headers:
                  Content-Type: application/json
                  Accept: application/json
                json:
                  auctionId: "{{ aucId }}"
                  user: "{{ uId }}"
                  amount: "{{ aucLastBid }}"
            whileTrue: "randomLoop90"
          whileTrue: "randomLoop70"
        count: 500